trade_exp/src/Catalogs/ОбъектыДоставки/ОбъектыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8a524563-74ec-492a-ad57-be7d69cd00c2">
  <name>ОбъектыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <owners>Catalog.Склады</owners>
  <owners>Catalog.СтруктураПредприятия</owners>
  <attributes extendedConfigurationObject="b632079c-a491-4c8e-a728-90dacee78346">
    <name>ВозможностьПодъезда</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2668b2c7-b6ec-40d4-b565-489e4e610198">
    <name>ВремяРаботыБудниПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="88d72d78-5ca5-4de7-850c-770d258db261">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="28bba8b3-7f4d-41ff-9455-7e94462d858a">
    <name>ВремяРаботыБудниС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="da76be5e-62bc-49f1-a480-3baa840d8945">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56dae0a6-ed25-4a8f-8960-60080f0a83d8">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67a11e9d-fb21-4fbe-b1e9-25b19a4610c6">
    <name>ВремяОбедаС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ee7fac32-7ba7-4358-9411-5e0d6ee7dda0">
    <name>ВремяОбедаПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b86ed39b-61ff-4079-8183-bd1677526f23">
    <name>ВремяРаботыСубботаС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6f4ad0c2-296a-4c89-adc8-16799ecba27a">
    <name>ВремяРаботыСубботаПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea2edc56-a45e-4c53-9a85-6f3eff97fd59">
    <name>ВремяРаботыВоскресеньеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0cc15041-40ec-4318-9cfe-5710655d1cbd">
    <name>ВремяРаботыВоскресеньеПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bbecceea-1384-494e-9c85-a679c5fce7b1">
    <name>Выходные</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>67</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f9744db6-485c-438f-8d91-cf893d00a27f">
    <name>ТелефонНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="60ca7753-bbb8-431d-a875-aea1947fc08e">
    <name>ТипТорговойТочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59d76235-dd31-458d-9411-3d9b7a493afc">
    <name>ФорматТорговогоЗала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a986424d-0a3e-4740-aca8-895cd32b4426">
    <name>СпособПолученияТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4d73832a-12f5-4f0d-a4aa-c15f4f66a53c">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="85dd6c90-1e42-443a-b972-69f9e2f364d2">
    <name>ПлощадьТорговогоЗала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a0fba8eb-3c71-45fc-bd14-5b04ba97ac80">
    <name>ПлощадьСклада</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3a8443db-459d-4bf3-a25d-2cbc05e35069">
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18e4024d-4ba5-4991-a924-640fa009ae81">
    <name>ТипПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d32c2e6-e32c-48e0-b914-04ada48b2f00">
    <name>ЗонаДоставкиДляВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c339f18-9086-4fbc-985e-6417c85b5e4b">
    <name>Стенд</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8cda761-0307-4453-a140-4b158f1006f4">
    <name>Субдилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="947bed4f-bc19-4990-baef-be8e1867234b">
    <name>Маркетплейс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="80c5f1a6-5211-42f4-a726-b34e70d01865">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b75d8f95-105a-4f58-aa1b-259a534bca75">
    <name>СозданАвтоматически</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="c2408c15-215d-4387-95bd-b0084a6336b2">
    <name>Стенды</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2a2c4a5a-ed90-4dbd-8431-204a72194ec1">
      <name>Стенд</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="d86afa7e-20a5-4cb3-b378-2f0a999ca4dd">
    <name>Субдилеры</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f37527f6-53de-448e-8079-ce81f042232e">
      <name>Субдилер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/ОбъектыДоставки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ОбъектДоставкиЕстьУПартнера(Широта=Неопределено,Долгота=Неопределено,Партнер) Экспорт  
	
	Условия = "
	|	И ОбъектыДоставки.Долгота = &Долгота
	|	И ОбъектыДоставки.Широта = &Широта";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК Результат
	|ИЗ
	|	Справочник.ОбъектыДоставки КАК ОбъектыДоставки
	|ГДЕ
	|	ОбъектыДоставки.Владелец = &Партнер
	|	И НЕ ОбъектыДоставки.Широта = 0
	|	И НЕ ОбъектыДоставки.Долгота = 0" + ?((Широта=Неопределено И Долгота=Неопределено),"", Условия);		
	
	Запрос.УстановитьПараметр("Долгота", Долгота);
	Запрос.УстановитьПараметр("Широта", Широта);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Возврат Не Запрос.Выполнить().Пустой();	
		
КонецФункции

Функция СоздатьОбъектДоставки(Структура) Экспорт
	
	ОбъектДоставки = Справочники.ОбъектыДоставки.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ОбъектДоставки,Структура);  

	Попытка 
		ОбъектДоставки.Записать();
	Исключение
		ОбъектДоставки = Справочники.ОбъектыДоставки.ПустаяСсылка();	
	КонецПопытки;

	Возврат ОбъектДоставки.Ссылка;
	
КонецФункции 

Функция ПолучитьСтруктуруОбъектаДоставки() Экспорт
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Широта",);
	СтруктураОбъекта.Вставить("Долгота",);
	СтруктураОбъекта.Вставить("Адрес",);
	СтруктураОбъекта.Вставить("ТелефонНаВыгрузке",);
	СтруктураОбъекта.Вставить("ЗонаДоставкиДляВодителя",);
	СтруктураОбъекта.Вставить("Наименование",);
	СтруктураОбъекта.Вставить("НомерДома",);
	СтруктураОбъекта.Вставить("НомерКвартиры",);
	СтруктураОбъекта.Вставить("НомерКорпуса",);
	СтруктураОбъекта.Вставить("НомерОфиса",);
	СтруктураОбъекта.Вставить("ДополнениеКАдресу",);
	СтруктураОбъекта.Вставить("АдресДоставкиКарта",);
	СтруктураОбъекта.Вставить("Владелец",);
	СтруктураОбъекта.Вставить("Автор",);
	СтруктураОбъекта.Вставить("СозданАвтоматически",);
	
	Возврат СтруктураОбъекта;
	
КонецФункции

#КонецЕсли
